tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1709_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1709_H_
#define _PIC16F1709_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define CCPIF                         60
#define SSP1IF                        61
#define TXIF                          62
#define RCIF                          63
#define ADIF                          64
#define TMR1GIF                       65
#define PIR2                          66
#define CCP2IF                        67
#define TMR4IF                        68
#define TMR6IF                        69
#define BCL1IF                        70
#define C1IF                          71
#define C2IF                          72
#define OSFIF                         73
#define PIR3                          74
#define CLC1IF                        75
#define CLC2IF                        76
#define CLC3IF                        77
#define ZCDIF                         78
#define COGIF                         79
#define TMR0                          80
#define TMR1L                         81
#define TMR1H                         82
#define T1CON                         83
#define TMR1ON                        84
#define nT1SYNC                       85
#define T1OSCEN                       86
#define T1CKPS0                       87
#define T1CKPS                        88
#define T1CKPS1                       89
#define TMR1CS0                       90
#define TMR1CS                        91
#define TMR1CS1                       92
#define T1GCON                        93
#define T1GSS0                        94
#define T1GSS                         95
#define T1GSS1                        96
#define T1GVAL                        97
#define T1GGO_nDONE                   98
#define T1GSPM                        99
#define T1GTM                         100
#define T1GPOL                        101
#define TMR1GE                        102
#define TMR2                          103
#define PR2                           104
#define T2CON                         105
#define T2CKPS0                       106
#define T2CKPS                        107
#define T2CKPS1                       108
#define TMR2ON                        109
#define T2OUTPS0                      110
#define T2OUTPS                       111
#define T2OUTPS1                      112
#define T2OUTPS2                      113
#define T2OUTPS3                      114
#define TRISA                         115
#define TRISA0                        116
#define TRISA1                        117
#define TRISA2                        118
#define TRISA4                        119
#define TRISA5                        120
#define TRISB                         121
#define TRISB4                        122
#define TRISB5                        123
#define TRISB6                        124
#define TRISB7                        125
#define TRISC                         126
#define TRISC0                        127
#define TRISC1                        128
#define TRISC2                        129
#define TRISC3                        130
#define TRISC4                        131
#define TRISC5                        132
#define TRISC6                        133
#define TRISC7                        134
#define PIE1                          135
#define TMR1IE                        136
#define TMR2IE                        137
#define CCP1IE                        138
#define CCPIE                         139
#define SSP1IE                        140
#define TXIE                          141
#define RCIE                          142
#define ADIE                          143
#define TMR1GIE                       144
#define PIE2                          145
#define CCP2IE                        146
#define TMR4IE                        147
#define TMR6IE                        148
#define BCL1IE                        149
#define C1IE                          150
#define C2IE                          151
#define OSFIE                         152
#define PIE3                          153
#define CLC1IE                        154
#define CLC2IE                        155
#define CLC3IE                        156
#define ZCDIE                         157
#define COGIE                         158
#define OPTION_REG                    159
#define PS                            160
#define PS0                           161
#define PS1                           162
#define PS2                           163
#define PSA                           164
#define T0SE                          165
#define TMR0SE                        166
#define T0CS                          167
#define TMR0CS                        168
#define INTEDG                        169
#define nWPUEN                        170
#define PCON                          171
#define nBOR                          172
#define nPOR                          173
#define nRI                           174
#define nRMCLR                        175
#define nRWDT                         176
#define STKUNF                        177
#define STKOVF                        178
#define WDTCON                        179
#define SWDTEN                        180
#define WDTPS                         181
#define WDTPS0                        182
#define WDTPS1                        183
#define WDTPS2                        184
#define WDTPS3                        185
#define WDTPS4                        186
#define OSCTUNE                       187
#define TUN0                          188
#define TUN                           189
#define TUN1                          190
#define TUN2                          191
#define TUN3                          192
#define TUN4                          193
#define TUN5                          194
#define OSCCON                        195
#define SCS0                          196
#define SCS                           197
#define SCS1                          198
#define IRCF                          199
#define IRCF0                         200
#define IRCF1                         201
#define IRCF2                         202
#define IRCF3                         203
#define SPLLEN                        204
#define OSCSTAT                       205
#define HFIOFS                        206
#define LFIOFR                        207
#define MFIOFR                        208
#define HFIOFL                        209
#define HFIOFR                        210
#define OSTS                          211
#define PLLR                          212
#define SOSCR                         213
#define ADRESL                        214
#define ADRESH                        215
#define ADCON0                        216
#define ADON                          217
#define GO_nDONE                      218
#define GO                            219
#define ADGO                          220
#define CHS0                          221
#define CHS                           222
#define CHS1                          223
#define CHS2                          224
#define CHS3                          225
#define CHS4                          226
#define ADCON1                        227
#define ADPREF0                       228
#define ADPREF                        229
#define ADPREF1                       230
#define ADNREF                        231
#define ADCS                          232
#define ADFM                          233
#define ADCON2                        234
#define TRIGSEL                       235
#define TRIGSEL0                      236
#define TRIGSEL1                      237
#define TRIGSEL2                      238
#define TRIGSEL3                      239
#define LATA                          240
#define LATA0                         241
#define LATA1                         242
#define LATA2                         243
#define LATA4                         244
#define LATA5                         245
#define LATB                          246
#define LATB4                         247
#define LATB5                         248
#define LATB6                         249
#define LATB7                         250
#define LATC                          251
#define LATC0                         252
#define LATC1                         253
#define LATC2                         254
#define LATC3                         255
#define LATC4                         256
#define LATC5                         257
#define LATC6                         258
#define LATC7                         259
#define CM1CON0                       260
#define C1SYNC                        261
#define C1HYS                         262
#define C1SP                          263
#define C1ZLF                         264
#define C1POL                         265
#define C1OUT                         266
#define C1ON                          267
#define CM1CON1                       268
#define C1NCH0                        269
#define C1NCH                         270
#define C1NCH1                        271
#define C1NCH2                        272
#define C1PCH                         273
#define C1PCH0                        274
#define C1PCH1                        275
#define C1PCH2                        276
#define C1INTN                        277
#define C1INTP                        278
#define CM2CON0                       279
#define C2SYNC                        280
#define C2HYS                         281
#define C2SP                          282
#define C2ZLF                         283
#define C2POL                         284
#define C2OUT                         285
#define C2ON                          286
#define CM2CON1                       287
#define C2NCH0                        288
#define C2NCH                         289
#define C2NCH1                        290
#define C2NCH2                        291
#define C2PCH                         292
#define C2PCH0                        293
#define C2PCH1                        294
#define C2PCH2                        295
#define C2INTN                        296
#define C2INTP                        297
#define CMOUT                         298
#define MC1OUT                        299
#define MC2OUT                        300
#define BORCON                        301
#define BORRDY                        302
#define BORFS                         303
#define SBOREN                        304
#define FVRCON                        305
#define ADFVR0                        306
#define ADFVR                         307
#define ADFVR1                        308
#define CDAFVR                        309
#define CDAFVR0                       310
#define CDAFVR1                       311
#define TSRNG                         312
#define TSEN                          313
#define FVRRDY                        314
#define FVREN                         315
#define DAC1CON0                      316
#define DACNSS                        317
#define DAC1NSS                       318
#define DACPSS                        319
#define DACPSS0                       320
#define DAC1PSS                       321
#define DAC1PSS0                      322
#define DACPSS1                       323
#define DAC1PSS1                      324
#define DACOE0                        325
#define DAC1OE2                       326
#define DAC1OE1                       327
#define DACOE1                        328
#define DACEN                         329
#define DAC1EN                        330
#define DAC1CON1                      331
#define DAC1R                         332
#define DACR0                         333
#define DAC1R0                        334
#define DACR1                         335
#define DAC1R1                        336
#define DACR2                         337
#define DAC1R2                        338
#define DACR3                         339
#define DAC1R3                        340
#define DACR4                         341
#define DAC1R4                        342
#define DACR5                         343
#define DAC1R5                        344
#define DACR6                         345
#define DAC1R6                        346
#define DACR7                         347
#define DAC1R7                        348
#define ZCD1CON                       349
#define ZCD1INTN                      350
#define ZCD1INTP                      351
#define ZCD1POL                       352
#define ZCD1OUT                       353
#define ZCD1EN                        354
#define ANSELA                        355
#define ANSA0                         356
#define ANSA1                         357
#define ANSA2                         358
#define ANSA4                         359
#define ANS5                          360
#define ANSELB                        361
#define ANSB4                         362
#define ANSB5                         363
#define ANSELC                        364
#define ANSC0                         365
#define ANSC1                         366
#define ANSC2                         367
#define ANSC3                         368
#define ANSC6                         369
#define ANSC7                         370
#define PMADRL                        371
#define PMADRH                        372
#define PMDATL                        373
#define PMDATH                        374
#define PMCON1                        375
#define RD                            376
#define WR                            377
#define WREN                          378
#define WRERR                         379
#define FREE                          380
#define LWLO                          381
#define CFGS                          382
#define PMCON2                        383
#define VREGCON                       384
#define VREGPM                        385
#define RC1REG                        386
#define TX1REG                        387
#define SP1BRGL                       388
#define SP1BRGH                       389
#define RC1STA                        390
#define RX9D                          391
#define OERR                          392
#define FERR                          393
#define ADDEN                         394
#define CREN                          395
#define SREN                          396
#define RX9                           397
#define SPEN                          398
#define TX1STA                        399
#define TX9D                          400
#define TRMT                          401
#define BRGH                          402
#define SENDB                         403
#define SYNC                          404
#define TXEN                          405
#define TX9                           406
#define CSRC                          407
#define BAUD1CON                      408
#define ABDEN                         409
#define WUE                           410
#define BRG16                         411
#define SCKP                          412
#define RCIDL                         413
#define ABDOVF                        414
#define WPUA                          415
#define WPUA0                         416
#define WPUA1                         417
#define WPUA2                         418
#define WPUA3                         419
#define WPUA4                         420
#define WPUA5                         421
#define WPUB                          422
#define WPUB4                         423
#define WPUB5                         424
#define WPUB6                         425
#define WPUB7                         426
#define WPUC                          427
#define WPUC0                         428
#define WPUC1                         429
#define WPUC2                         430
#define WPUC3                         431
#define WPUC4                         432
#define WPUC5                         433
#define WPUC6                         434
#define WPUC7                         435
#define SSP1BUF                       436
#define BUF                           437
#define BUF0                          438
#define SSP1BUF0                      439
#define BUF1                          440
#define SSP1BUF1                      441
#define BUF2                          442
#define SSP1BUF2                      443
#define BUF3                          444
#define SSP1BUF3                      445
#define BUF4                          446
#define SSP1BUF4                      447
#define BUF5                          448
#define SSP1BUF5                      449
#define BUF6                          450
#define SSP1BUF6                      451
#define BUF7                          452
#define SSP1BUF7                      453
#define ADD0                          454
#define ADD                           455
#define SSP1ADD0                      456
#define SSP1ADD                       457
#define ADD1                          458
#define SSP1ADD1                      459
#define ADD2                          460
#define SSP1ADD2                      461
#define ADD3                          462
#define SSP1ADD3                      463
#define ADD4                          464
#define SSP1ADD4                      465
#define ADD5                          466
#define SSP1ADD5                      467
#define ADD6                          468
#define SSP1ADD6                      469
#define ADD7                          470
#define SSP1ADD7                      471
#define SSP1MSK0                      472
#define SSP1MSK                       473
#define MSK0                          474
#define MSK                           475
#define SSP1MSK1                      476
#define MSK1                          477
#define SSP1MSK2                      478
#define MSK2                          479
#define SSP1MSK3                      480
#define MSK3                          481
#define SSP1MSK4                      482
#define MSK4                          483
#define SSP1MSK5                      484
#define MSK5                          485
#define SSP1MSK6                      486
#define MSK6                          487
#define SSP1MSK7                      488
#define MSK7                          489
#define SSP1STAT                      490
#define BF                            491
#define UA                            492
#define R_nW                          493
#define S                             494
#define P                             495
#define D_nA                          496
#define CKE                           497
#define SMP                           498
#define SSP1CON1                      499
#define SSPM0                         500
#define SSPM                          501
#define SSPM1                         502
#define SSPM2                         503
#define SSPM3                         504
#define CKP                           505
#define SSPEN                         506
#define SSPOV                         507
#define WCOL                          508
#define SSP1CON2                      509
#define SEN                           510
#define RSEN                          511
#define PEN                           512
#define RCEN                          513
#define ACKEN                         514
#define ACKDT                         515
#define ACKSTAT                       516
#define GCEN                          517
#define SSP1CON3                      518
#define DHEN                          519
#define AHEN                          520
#define SBCDE                         521
