tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1709_tdd.h
#define SDAHT                         522
#define BOEN                          523
#define SCIE                          524
#define PCIE                          525
#define ACKTIM                        526
#define ODCONA                        527
#define ODA0                          528
#define ODA1                          529
#define ODA2                          530
#define ODA4                          531
#define ODA5                          532
#define ODCONB                        533
#define ODB4                          534
#define ODB5                          535
#define ODB6                          536
#define ODB7                          537
#define ODCONC                        538
#define ODC0                          539
#define ODC1                          540
#define ODC2                          541
#define ODC3                          542
#define ODC4                          543
#define ODC5                          544
#define ODC6                          545
#define ODC7                          546
#define CCPR1L                        547
#define CCPR1H                        548
#define CCP1CON                       549
#define CCP1M0                        550
#define CCP1M                         551
#define CCP1M1                        552
#define CCP1M2                        553
#define CCP1M3                        554
#define CCP1Y                         555
#define DC1B                          556
#define DC1B0                         557
#define CCP1X                         558
#define DC1B1                         559
#define CCPR2L                        560
#define CCPR2H                        561
#define CCP2CON                       562
#define CCP2M                         563
#define CCP2M0                        564
#define CCP2M1                        565
#define CCP2M2                        566
#define CCP2M3                        567
#define DC2B0                         568
#define CCP2Y                         569
#define DC2B                          570
#define DC2B1                         571
#define CCP2X                         572
#define CCPTMRS                       573
#define C1TSEL0                       574
#define C1TSEL                        575
#define C1TSEL1                       576
#define C2TSEL0                       577
#define C2TSEL                        578
#define C2TSEL1                       579
#define P3TSEL                        580
#define P3TSEL0                       581
#define P3TSEL1                       582
#define P4TSEL0                       583
#define P4TSEL                        584
#define P4TSEL1                       585
#define SLRCONA                       586
#define SLRA0                         587
#define SLRA1                         588
#define SLRA2                         589
#define SLRA4                         590
#define SLRA5                         591
#define SLRCONB                       592
#define SLRB4                         593
#define SLRB5                         594
#define SLRB6                         595
#define SLRB7                         596
#define SLRCONC                       597
#define SLRC0                         598
#define SLRC1                         599
#define SLRC2                         600
#define SLRC3                         601
#define SLRC4                         602
#define SLRC5                         603
#define SLRC6                         604
#define SLRC7                         605
#define INLVLA                        606
#define INLVLA0                       607
#define INLVLA1                       608
#define INLVLA2                       609
#define INLVLA3                       610
#define INLVLA4                       611
#define INLVLA5                       612
#define INLVLB                        613
#define INLVLB4                       614
#define INLVLB5                       615
#define INLVLB6                       616
#define INLVLB7                       617
#define INLVLC                        618
#define INLVLC0                       619
#define INLVLC1                       620
#define INLVLC2                       621
#define INLVLC3                       622
#define INLVLC4                       623
#define INLVLC5                       624
#define INLVLC6                       625
#define INLVLC7                       626
#define IOCAP                         627
#define IOCAP0                        628
#define IOCAP1                        629
#define IOCAP2                        630
#define IOCAP3                        631
#define IOCAP4                        632
#define IOCAP5                        633
#define IOCAN                         634
#define IOCAN0                        635
#define IOCAN1                        636
#define IOCAN2                        637
#define IOCAN3                        638
#define IOCAN4                        639
#define IOCAN5                        640
#define IOCAF                         641
#define IOCAF0                        642
#define IOCAF1                        643
#define IOCAF2                        644
#define IOCAF3                        645
#define IOCAF4                        646
#define IOCAF5                        647
#define IOCBP                         648
#define IOCBP4                        649
#define IOCBP5                        650
#define IOCBP6                        651
#define IOCBP7                        652
#define IOCBN                         653
#define IOCBN4                        654
#define IOCBN5                        655
#define IOCBN6                        656
#define IOCBN7                        657
#define IOCBF                         658
#define IOCBF4                        659
#define IOCBF5                        660
#define IOCBF6                        661
#define IOCBF7                        662
#define IOCCP                         663
#define IOCCP0                        664
#define IOCCP1                        665
#define IOCCP2                        666
#define IOCCP3                        667
#define IOCCP4                        668
#define IOCCP5                        669
#define IOCCP6                        670
#define IOCCP7                        671
#define IOCCN                         672
#define IOCCN0                        673
#define IOCCN1                        674
#define IOCCN2                        675
#define IOCCN3                        676
#define IOCCN4                        677
#define IOCCN5                        678
#define IOCCN6                        679
#define IOCCN7                        680
#define IOCCF                         681
#define IOCCF0                        682
#define IOCCF1                        683
#define IOCCF2                        684
#define IOCCF3                        685
#define IOCCF4                        686
#define IOCCF5                        687
#define IOCCF6                        688
#define IOCCF7                        689
#define TMR4                          690
#define PR4                           691
#define T4CON                         692
#define T4CKPS0                       693
#define T4CKPS                        694
#define T4CKPS1                       695
#define TMR4ON                        696
#define T4OUTPS                       697
#define T4OUTPS0                      698
#define T4OUTPS1                      699
#define T4OUTPS2                      700
#define T4OUTPS3                      701
#define TMR6                          702
#define PR6                           703
#define T6CON                         704
#define T6CKPS0                       705
#define T6CKPS                        706
#define T6CKPS1                       707
#define TMR6ON                        708
#define T6OUTPS0                      709
#define T6OUTPS                       710
#define T6OUTPS1                      711
#define T6OUTPS2                      712
#define T6OUTPS3                      713
#define OPA1CON                       714
#define OPA1PCH                       715
#define OPA1PCH0                      716
#define OPA1PCH1                      717
#define OPA1UG                        718
#define OPA1SP                        719
#define OPA1EN                        720
#define OPA2CON                       721
#define OPA2PCH                       722
#define OPA2PCH0                      723
#define OPA2PCH1                      724
#define OPA2UG                        725
#define OPA2SP                        726
#define OPA2EN                        727
#define PWM3DCL0                      728
#define PWM3DCL                       729
#define PWM3DCL1                      730
#define PWM3DCH0                      731
#define PWM3DCH                       732
#define PWM3DCH1                      733
#define PWM3DCH2                      734
#define PWM3DCH3                      735
#define PWM3DCH4                      736
#define PWM3DCH5                      737
#define PWM3DCH6                      738
#define PWM3DCH7                      739
#define PWM3CON                       740
#define PWM3POL                       741
#define PWM3OUT                       742
#define PWM3EN                        743
#define PWM4DCL                       744
#define PWM4DCL0                      745
#define PWM4DCL1                      746
#define PWM4DCH0                      747
#define PWM4DCH                       748
#define PWM4DCH1                      749
#define PWM4DCH2                      750
#define PWM4DCH3                      751
#define PWM4DCH4                      752
#define PWM4DCH5                      753
#define PWM4DCH6                      754
#define PWM4DCH7                      755
#define PWM4CON                       756
#define PWM4POL                       757
#define PWM4OUT                       758
#define PWM4EN                        759
#define COG1PHR                       760
#define G1PHR                         761
#define G1PHR0                        762
#define G1PHR1                        763
#define G1PHR2                        764
#define G1PHR3                        765
#define G1PHR4                        766
#define G1PHR5                        767
#define COG1PHF                       768
#define G1PHF0                        769
#define G1PHF                         770
#define G1PHF1                        771
#define G1PHF2                        772
#define G1PHF3                        773
#define G1PHF4                        774
#define G1PHF5                        775
#define COG1BLKR                      776
#define G1BLKR                        777
#define G1BLKR0                       778
#define G1BLKR1                       779
#define G1BLKR2                       780
#define G1BLKR3                       781
#define G1BLKR4                       782
#define G1BLKR5                       783
#define COG1BLKF                      784
#define G1BLKF                        785
#define G1BLKF0                       786
#define G1BLKF1                       787
#define G1BLKF2                       788
#define G1BLKF3                       789
#define G1BLKF4                       790
#define G1BLKF5                       791
#define COG1DBR                       792
#define G1DBR0                        793
#define G1DBR                         794
#define G1DBR1                        795
#define G1DBR2                        796
#define G1DBR3                        797
#define G1DBR4                        798
#define G1DBR5                        799
#define COG1DBF                       800
#define G1DBF0                        801
#define G1DBF                         802
#define G1DBF1                        803
#define G1DBF2                        804
#define G1DBF3                        805
#define G1DBF4                        806
#define G1DBF5                        807
#define COG1CON0                      808
#define G1MD0                         809
#define G1MD                          810
#define G1MD1                         811
#define G1MD2                         812
#define G1CS0                         813
#define G1CS                          814
#define G1CS1                         815
#define G1LD                          816
#define G1EN                          817
#define COG1CON1                      818
#define G1POLA                        819
#define G1POLB                        820
#define G1POLC                        821
#define G1POLD                        822
#define G1FDBS                        823
#define G1RDBS                        824
#define COG1RIS                       825
#define G1RIS0                        826
#define G1RIS1                        827
#define G1RIS2                        828
#define G1RIS3                        829
#define G1RIS4                        830
#define G1RIS5                        831
#define G1RIS6                        832
#define COG1RSIM                      833
#define G1RSIM0                       834
#define G1RSIM1                       835
#define G1RSIM2                       836
#define G1RSIM3                       837
#define G1RSIM4                       838
#define G1RSIM5                       839
#define G1RSIM6                       840
#define COG1FIS                       841
#define G1FIS0                        842
#define G1FIS1                        843
#define G1FIS2                        844
#define G1FIS3                        845
#define G1FIS4                        846
#define G1FIS5                        847
#define G1FIS6                        848
#define COG1FSIM                      849
#define G1FSIM0                       850
#define G1FSIM1                       851
#define G1FSIM2                       852
#define G1FSIM3                       853
#define G1FSIM4                       854
#define G1FSIM5                       855
#define G1FSIM6                       856
#define COG1ASD0                      857
#define G1ASDAC0                      858
#define G1ASDAC                       859
#define G1ASDAC1                      860
#define G1ASDBD0                      861
#define G1ASDBD                       862
#define G1ASDBD1                      863
#define G1ARSEN                       864
#define G1ASE                         865
#define COG1ASD1                      866
#define G1AS0E                        867
#define G1AS1E                        868
#define G1AS2E                        869
#define G1AS3E                        870
#define COG1STR                       871
#define G1STRA                        872
#define G1STRB                        873
#define G1STRC                        874
#define G1STRD                        875
#define G1SDATA                       876
#define G1SDATB                       877
#define G1SDATC                       878
#define G1SDATD                       879
#define PPSLOCK                       880
#define PPSLOCKED                     881
#define INTPPS                        882
#define T0CKIPPS                      883
#define T1CKIPPS                      884
#define T1GPPS                        885
#define CCP1PPS                       886
#define CCP2PPS                       887
#define COGINPPS                      888
#define SSPCLKPPS                     889
#define SSPDATPPS                     890
#define SSPSSPPS                      891
#define RXPPS                         892
#define CKPPS                         893
#define CLCIN0PPS                     894
#define CLCIN1PPS                     895
#define CLCIN2PPS                     896
#define CLCIN3PPS                     897
#define RA0PPS                        898
#define RA1PPS                        899
#define RA2PPS                        900
#define RA4PPS                        901
#define RA5PPS                        902
#define RB4PPS                        903
#define RB5PPS                        904
#define RB6PPS                        905
#define RB7PPS                        906
#define RC0PPS                        907
#define RC1PPS                        908
#define RC2PPS                        909
#define RC3PPS                        910
#define RC4PPS                        911
#define RC5PPS                        912
#define RC6PPS                        913
#define RC7PPS                        914
#define CLCDATA                       915
#define MCLC1OUT                      916
#define MCLC2OUT                      917
#define MCLC3OUT                      918
#define CLC1CON                       919
#define CLC1CON_MODE                  920
#define LC1MODE0                      921
#define LC1MODE                       922
#define CLC1CON_MODE0                 923
#define LC1MODE1                      924
#define CLC1CON_MODE1                 925
#define CLC1CON_MODE2                 926
#define LC1MODE2                      927
#define LC1INTN                       928
#define CLC1CON_INTN                  929
#define LC1INTP                       930
#define CLC1CON_INTP                  931
#define CLC1CON_OUT                   932
#define LC1OUT                        933
#define LC1EN                         934
#define CLC1CON_EN                    935
#define CLC1POL                       936
#define LC1G1POL                      937
#define CLC1POL_G1POL                 938
#define CLC1POL_G2POL                 939
#define LC1G2POL                      940
#define LC1G3POL                      941
#define CLC1POL_G3POL                 942
#define LC1G4POL                      943
#define CLC1POL_G4POL                 944
#define CLC1POL_POL                   945
#define LC1POL                        946
#define CLC1SEL0                      947
#define CLC1SEL0_D1S0                 948
#define LC1D1S                        949
#define LC1D1S0                       950
#define CLC1SEL0_D1S                  951
#define CLC1SEL0_D1S1                 952
#define LC1D1S1                       953
#define CLC1SEL0_D1S2                 954
#define LC1D1S2                       955
#define CLC1SEL0_D1S3                 956
#define LC1D1S3                       957
#define CLC1SEL0_D1S4                 958
#define LC1D1S4                       959
#define CLC1SEL1                      960
#define CLC1SEL1_D2S0                 961
#define CLC1SEL1_D2S                  962
#define LC1D2S                        963
#define LC1D2S0                       964
#define CLC1SEL1_D2S1                 965
#define LC1D2S1                       966
#define LC1D2S2                       967
#define CLC1SEL1_D2S2                 968
#define LC1D2S3                       969
#define CLC1SEL1_D2S3                 970
#define LC1D2S4                       971
#define CLC1SEL1_D2S4                 972
#define CLC1SEL2                      973
#define LC1D3S0                       974
#define CLC1SEL2_D3S                  975
#define LC1D3S                        976
#define CLC1SEL2_D3S0                 977
#define LC1D3S1                       978
#define CLC1SEL2_D3S1                 979
#define LC1D3S2                       980
#define CLC1SEL2_D3S2                 981
#define LC1D3S3                       982
#define CLC1SEL2_D3S3                 983
#define LC1D3S4                       984
#define CLC1SEL2_D3S4                 985
#define CLC1SEL3                      986
#define CLC1SEL3_D4S                  987
#define LC1D4S                        988
#define LC1D4S0                       989
#define CLC1SEL3_D4S0                 990
#define CLC1SEL3_D4S1                 991
#define LC1D4S1                       992
#define LC1D4S2                       993
#define CLC1SEL3_D4S2                 994
#define LC1D4S3                       995
#define CLC1SEL3_D4S3                 996
#define LC1D4S4                       997
#define CLC1SEL3_D4S4                 998
#define CLC1GLS0                      999
#define CLC1GLS0_D1N                  1000
#define LC1G1D1N                      1001
#define CLC1GLS0_D1T                  1002
#define LC1G1D1T                      1003
#define LC1G1D2N                      1004
#define CLC1GLS0_D2N                  1005
#define LC1G1D2T                      1006
#define CLC1GLS0_D2T                  1007
#define CLC1GLS0_D3N                  1008
#define LC1G1D3N                      1009
#define CLC1GLS0_D3T                  1010
#define LC1G1D3T                      1011
#define CLC1GLS0_D4N                  1012
#define LC1G1D4N                      1013
#define CLC1GLS0_D4T                  1014
#define LC1G1D4T                      1015
#define CLC1GLS1                      1016
#define CLC1GLS1_D1N                  1017
#define LC1G2D1N                      1018
#define LC1G2D1T                      1019
#define CLC1GLS1_D1T                  1020
#define CLC1GLS1_D2N                  1021
#define LC1G2D2N                      1022
#define LC1G2D2T                      1023
#define CLC1GLS1_D2T                  1024
#define CLC1GLS1_D3N                  1025
#define LC1G2D3N                      1026
#define LC1G2D3T                      1027
#define CLC1GLS1_D3T                  1028
#define CLC1GLS1_D4N                  1029
#define LC1G2D4N                      1030
#define LC1G2D4T                      1031
#define CLC1GLS1_D4T                  1032
#define CLC1GLS2                      1033
#define CLC1GLS2_D1N                  1034
#define LC1G3D1N                      1035
#define LC1G3D1T                      1036
#define CLC1GLS2_D1T                  1037
#define LC1G3D2N                      1038
#define CLC1GLS2_D2N                  1039
#define LC1G3D2T                      1040
#define CLC1GLS2_D2T                  1041
#define CLC1GLS2_D3N                  1042
#define LC1G3D3N                      1043
#define LC1G3D3T                      1044
#define CLC1GLS2_D3T                  1045
#define LC1G3D4N                      1046
#define CLC1GLS2_D4N                  1047
#define LC1G3D4T                      1048
#define CLC1GLS2_D4T                  1049
#define CLC1GLS3                      1050
#define LC1G4D1N                      1051
#define CLC1GLS3_G4D1N                1052
#define LC1G4D1T                      1053
#define CLC1GLS3_G4D1T                1054
#define CLC1GLS3_G4D2N                1055
#define LC1G4D2N                      1056
#define CLC1GLS3_G4D2T                1057
#define LC1G4D2T                      1058
#define LC1G4D3N                      1059
#define CLC1GLS3_G4D3N                1060
#define LC1G4D3T                      1061
#define CLC1GLS3_G4D3T                1062
#define CLC1GLS3_G4D4N                1063
#define LC1G4D4N                      1064
#define CLC1GLS3_G4D4T                1065
#define LC1G4D4T                      1066
#define CLC2CON                       1067
#define LC2MODE0                      1068
#define CLC2CON_MODE                  1069
#define LC2MODE                       1070
#define CLC2CON_MODE0                 1071
#define LC2MODE1                      1072
#define CLC2CON_MODE1                 1073
#define LC2MODE2                      1074
#define CLC2CON_MODE2                 1075
#define LC2INTN                       1076
#define CLC2CON_INTN                  1077
#define LC2INTP                       1078
#define CLC2CON_INTP                  1079
#define CLC2CON_OUT                   1080
#define LC2OUT                        1081
#define CLC2CON_EN                    1082
#define LC2EN                         1083
#define CLC2POL                       1084
#define LC2G1POL                      1085
#define CLC2POL_G1POL                 1086
#define LC2G2POL                      1087
#define CLC2POL_G2POL                 1088
#define LC2G3POL                      1089
#define CLC2POL_G3POL                 1090
