tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1709_tdd.h
#define LC2G4POL                      1091
#define CLC2POL_G4POL                 1092
#define CLC2POL_POL                   1093
#define LC2POL                        1094
#define CLC2SEL0                      1095
#define CLC2SEL0_D1S                  1096
#define LC2D1S0                       1097
#define CLC2SEL0_D1S0                 1098
#define LC2D1S                        1099
#define LC2D1S1                       1100
#define CLC2SEL0_D1S1                 1101
#define LC2D1S2                       1102
#define CLC2SEL0_D1S2                 1103
#define CLC2SEL0_D1S3                 1104
#define LC2D1S3                       1105
#define LC2D1S4                       1106
#define CLC2SEL0_D1S4                 1107
#define CLC2SEL1                      1108
#define LC2D2S0                       1109
#define CLC2SEL1_D2S0                 1110
#define LC2D2S                        1111
#define CLC2SEL1_D2S                  1112
#define LC2D2S1                       1113
#define CLC2SEL1_D2S1                 1114
#define LC2D2S2                       1115
#define CLC2SEL1_D2S2                 1116
#define LC2D2S3                       1117
#define CLC2SEL1_D2S3                 1118
#define LC2D2S4                       1119
#define CLC2SEL1_D2S4                 1120
#define CLC2SEL2                      1121
#define CLC2SEL2_D3S                  1122
#define LC2D3S0                       1123
#define CLC2SEL2_D3S0                 1124
#define LC2D3S                        1125
#define CLC2SEL2_D3S1                 1126
#define LC2D3S1                       1127
#define LC2D3S2                       1128
#define CLC2SEL2_D3S2                 1129
#define LC2D3S3                       1130
#define CLC2SEL2_D3S3                 1131
#define LC2D3S4                       1132
#define CLC2SEL2_D3S4                 1133
#define CLC2SEL3                      1134
#define LC2D4S                        1135
#define LC2D4S0                       1136
#define CLC2SEL3_D4S                  1137
#define CLC2SEL3_D4S0                 1138
#define LC2D4S1                       1139
#define CLC2SEL3_D4S1                 1140
#define LC2D4S2                       1141
#define CLC2SEL3_D4S2                 1142
#define CLC2SEL3_D4S3                 1143
#define LC2D4S3                       1144
#define LC2D4S4                       1145
#define CLC2SEL3_D4S4                 1146
#define CLC2GLS0                      1147
#define LC2G1D1N                      1148
#define CLC2GLS0_D1N                  1149
#define CLC2GLS0_D1T                  1150
#define LC2G1D1T                      1151
#define LC2G1D2N                      1152
#define CLC2GLS0_D2N                  1153
#define CLC2GLS0_D2T                  1154
#define LC2G1D2T                      1155
#define LC2G1D3N                      1156
#define CLC2GLS0_D3N                  1157
#define CLC2GLS0_D3T                  1158
#define LC2G1D3T                      1159
#define LC2G1D4N                      1160
#define CLC2GLS0_D4N                  1161
#define CLC2GLS0_D4T                  1162
#define LC2G1D4T                      1163
#define CLC2GLS1                      1164
#define CLC2GLS1_D1N                  1165
#define LC2G2D1N                      1166
#define CLC2GLS1_D1T                  1167
#define LC2G2D1T                      1168
#define CLC2GLS1_D2N                  1169
#define LC2G2D2N                      1170
#define CLC2GLS1_D2T                  1171
#define LC2G2D2T                      1172
#define LC2G2D3N                      1173
#define CLC2GLS1_D3N                  1174
#define LC2G2D3T                      1175
#define CLC2GLS1_D3T                  1176
#define LC2G2D4N                      1177
#define CLC2GLS1_D4N                  1178
#define LC2G2D4T                      1179
#define CLC2GLS1_D4T                  1180
#define CLC2GLS2                      1181
#define LC2G3D1N                      1182
#define CLC2GLS2_D1N                  1183
#define CLC2GLS2_D1T                  1184
#define LC2G3D1T                      1185
#define CLC2GLS2_D2N                  1186
#define LC2G3D2N                      1187
#define LC2G3D2T                      1188
#define CLC2GLS2_D2T                  1189
#define CLC2GLS2_D3N                  1190
#define LC2G3D3N                      1191
#define CLC2GLS2_D3T                  1192
#define LC2G3D3T                      1193
#define CLC2GLS2_D4N                  1194
#define LC2G3D4N                      1195
#define LC2G3D4T                      1196
#define CLC2GLS2_D4T                  1197
#define CLC2GLS3                      1198
#define LC2G4D1N                      1199
#define CLC2GLS3_G4D1N                1200
#define CLC2GLS3_G4D1T                1201
#define LC2G4D1T                      1202
#define CLC2GLS3_G4D2N                1203
#define LC2G4D2N                      1204
#define LC2G4D2T                      1205
#define CLC2GLS3_G4D2T                1206
#define CLC2GLS3_G4D3N                1207
#define LC2G4D3N                      1208
#define CLC2GLS3_G4D3T                1209
#define LC2G4D3T                      1210
#define LC2G4D4N                      1211
#define CLC2GLS3_G4D4N                1212
#define CLC2GLS3_G4D4T                1213
#define LC2G4D4T                      1214
#define CLC3CON                       1215
#define LC3MODE0                      1216
#define CLC3CON_MODE0                 1217
#define CLC3CON_MODE                  1218
#define LC3MODE                       1219
#define LC3MODE1                      1220
#define CLC3CON_MODE1                 1221
#define LC3MODE2                      1222
#define CLC3CON_MODE2                 1223
#define LC3INTN                       1224
#define CLC3CON_INTN                  1225
#define CLC3CON_INTP                  1226
#define LC3INTP                       1227
#define CLC3CON_OUT                   1228
#define LC3OUT                        1229
#define LC3EN                         1230
#define CLC3CON_EN                    1231
#define CLC3POL                       1232
#define LC3G1POL                      1233
#define CLC3POL_G1POL                 1234
#define LC3G2POL                      1235
#define CLC3POL_G2POL                 1236
#define CLC3POL_G3POL                 1237
#define LC3G3POL                      1238
#define LC3G4POL                      1239
#define CLC3POL_G4POL                 1240
#define LC3POL                        1241
#define CLC3POL_POL                   1242
#define CLC3SEL0                      1243
#define CLC3SEL0_D1S0                 1244
#define LC3D1S0                       1245
#define LC3D1S                        1246
#define CLC3SEL0_D1S                  1247
#define LC3D1S1                       1248
#define CLC3SEL0_D1S1                 1249
#define LC3D1S2                       1250
#define CLC3SEL0_D1S2                 1251
#define LC3D1S3                       1252
#define CLC3SEL0_D1S3                 1253
#define LC3D1S4                       1254
#define CLC3SEL0_D1S4                 1255
#define CLC3SEL1                      1256
#define CLC3SEL1_D2S                  1257
#define CLC3SEL1_D2S0                 1258
#define LC3D2S                        1259
#define LC3D2S0                       1260
#define CLC3SEL1_D2S1                 1261
#define LC3D2S1                       1262
#define CLC3SEL1_D2S2                 1263
#define LC3D2S2                       1264
#define CLC3SEL1_D2S3                 1265
#define LC3D2S3                       1266
#define LC3D2S4                       1267
#define CLC3SEL1_D2S4                 1268
#define CLC3SEL2                      1269
#define CLC3SEL2_D3S0                 1270
#define LC3D3S                        1271
#define CLC3SEL2_D3S                  1272
#define LC3D3S0                       1273
#define LC3D3S1                       1274
#define CLC3SEL2_D3S1                 1275
#define LC3D3S2                       1276
#define CLC3SEL2_D3S2                 1277
#define LC3D3S3                       1278
#define CLC3SEL2_D3S3                 1279
#define LC3D3S4                       1280
#define CLC3SEL2_D3S4                 1281
#define CLC3SEL3                      1282
#define CLC3SEL3_D4S0                 1283
#define LC3D4S0                       1284
#define LC3D4S                        1285
#define CLC3SEL3_D4S                  1286
#define LC3D4S1                       1287
#define CLC3SEL3_D4S1                 1288
#define LC3D4S2                       1289
#define CLC3SEL3_D4S2                 1290
#define LC3D4S3                       1291
#define CLC3SEL3_D4S3                 1292
#define LC3D4S4                       1293
#define CLC3SEL3_D4S4                 1294
#define CLC3GLS0                      1295
#define CLC3GLS0_D1N                  1296
#define LC3G1D1N                      1297
#define LC3G1D1T                      1298
#define CLC3GLS0_D1T                  1299
#define LC3G1D2N                      1300
#define CLC3GLS0_D2N                  1301
#define CLC3GLS0_D2T                  1302
#define LC3G1D2T                      1303
#define CLC3GLS0_D3N                  1304
#define LC3G1D3N                      1305
#define LC3G1D3T                      1306
#define CLC3GLS0_D3T                  1307
#define CLC3GLS0_D4N                  1308
#define LC3G1D4N                      1309
#define CLC3GLS0_D4T                  1310
#define LC3G1D4T                      1311
#define CLC3GLS1                      1312
#define LC3G2D1N                      1313
#define CLC3GLS1_D1N                  1314
#define CLC3GLS1_D1T                  1315
#define LC3G2D1T                      1316
#define LC3G2D2N                      1317
#define CLC3GLS1_D2N                  1318
#define LC3G2D2T                      1319
#define CLC3GLS1_D2T                  1320
#define LC3G2D3N                      1321
#define CLC3GLS1_D3N                  1322
#define CLC3GLS1_D3T                  1323
#define LC3G2D3T                      1324
#define LC3G2D4N                      1325
#define CLC3GLS1_D4N                  1326
#define LC3G2D4T                      1327
#define CLC3GLS1_D4T                  1328
#define CLC3GLS2                      1329
#define LC3G3D1N                      1330
#define CLC3GLS2_D1N                  1331
#define LC3G3D1T                      1332
#define CLC3GLS2_D1T                  1333
#define CLC3GLS2_D2N                  1334
#define LC3G3D2N                      1335
#define CLC3GLS2_D2T                  1336
#define LC3G3D2T                      1337
#define CLC3GLS2_D3N                  1338
#define LC3G3D3N                      1339
#define LC3G3D3T                      1340
#define CLC3GLS2_D3T                  1341
#define CLC3GLS2_D4N                  1342
#define LC3G3D4N                      1343
#define CLC3GLS2_D4T                  1344
#define LC3G3D4T                      1345
#define CLC3GLS3                      1346
#define LC3G4D1N                      1347
#define CLC3GLS3_G4D1N                1348
#define LC3G4D1T                      1349
#define CLC3GLS3_G4D1T                1350
#define LC3G4D2N                      1351
#define CLC3GLS3_G4D2N                1352
#define CLC3GLS3_G4D2T                1353
#define LC3G4D2T                      1354
#define LC3G4D3N                      1355
#define CLC3GLS3_G4D3N                1356
#define CLC3GLS3_G4D3T                1357
#define LC3G4D3T                      1358
#define LC3G4D4N                      1359
#define CLC3GLS3_G4D4N                1360
#define LC3G4D4T                      1361
#define CLC3GLS3_G4D4T                1362
#define ICDBK0H                       1363
#define BKA8                          1364
#define BKA9                          1365
#define BKA10                         1366
#define BKA11                         1367
#define BKA12                         1368
#define BKA13                         1369
#define BKA14                         1370
#define STATUS_SHAD                   1371
#define C_SHAD                        1372
#define DC_SHAD                       1373
#define Z_SHAD                        1374
#define WREG_SHAD                     1375
#define BSR_SHAD                      1376
#define PCLATH_SHAD                   1377
#define FSR0L_SHAD                    1378
#define FSR0H_SHAD                    1379
#define FSR1L_SHAD                    1380
#define FSR1H_SHAD                    1381
#define STKPTR                        1382
#define TOSL                          1383
#define TOSH                          1384

#endif // _PIC16F1709_H_
